RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_syspm_v3.c
        /* Execute callback functions with required type and mode */
        while (curCallback != NULL)
        {
            /* The modes defined in the .skipMode element are not executed */
            if (0UL == ((uint32_t) mode & curCallback->skipMode))
            {
                /* Update elements for local callback parameter values */
                curParams.base = curCallback->callbackParams->base;
                curParams.context = curCallback->callbackParams->context;

                retVal = curCallback->callback(&curParams, mode);
            }
            curCallback = curCallback->prevItm;
        }
    }

    return retVal;
}

cy_stc_syspm_callback_t* Cy_SysPm_GetFailedCallback(cy_en_syspm_callback_type_t type)
{
    return failedCallback[(uint32_t) type];
}

/*******************************************************************************
* Function Name: Cy_SysPm_IoFreeze
****************************************************************************//**
*
* Freezes IOs.
*
* Freezes the IO cells directly to save the IO-cell state on a wakeup from the
* Hibernate. Do not call this function before entering the
* Hibernate mode, because Cy_SysPm_Hibernate() function freezes the IO cells.
*
******************************************************************************/
void Cy_SysPm_IoFreeze(void)
{
    uint32_t interruptState;
    uint32_t regValue;

    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Check the FREEZE state to avoid a recurrent IO-cells freeze attempt,
    * because the second call to this function will cause an accidental switch
    * to the hibernate mode (the system will enter the hibernate mode immediately
    * after writing to the hibernate bit because both UNLOCK and FREEZE were set
    * correctly in the previous call to this function).
    */
    if(!Cy_SysPm_IoIsFrozen())
    {
        /* Clear the unlock field for correct freeze of the IO cells */
        SRSS_PWR_HIBERNATE = _CLR_SET_FLD32U((SRSS_PWR_HIBERNATE), SRSS_PWR_HIBERNATE_UNLOCK, 0u);

        /* Disable overriding by the peripherals the next pin-freeze command */
        SRSS_PWR_HIBERNATE |=  CY_SYSPM_PWR_HIBERNATE_UNLOCK |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_FREEZE, 1u) |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_HIBERNATE, 1u);

        /* If Read is after Write, read this register two times to delay
        *  enough time for internal settling.
        */
        (void) SRSS_PWR_HIBERNATE;
        (void) SRSS_PWR_HIBERNATE;

        /* The second Write causes freeze of IO cells to save the IO-cell state */
        regValue = SRSS_PWR_HIBERNATE;
        SRSS_PWR_HIBERNATE = regValue;
    }
    Cy_SysLib_ExitCriticalSection(interruptState);
}

void Cy_SysPm_IoUnfreeze(void)
{
    uint32_t interruptState;
    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Preserve the last reset reason and wakeup polarity. Then, unfreeze I/O:
     * write PWR_HIBERNATE.FREEZE=0, .UNLOCK=0x3A, .HIBERANTE=0
     */
    SRSS_PWR_HIBERNATE = (SRSS_PWR_HIBERNATE & HIBERNATE_RETAIN_STATUS_MASK) | HIBERNATE_UNLOCK_VAL;

    /* Lock the Hibernate mode:
    * write PWR_HIBERNATE.HIBERNATE=0, UNLOCK=0x00, HIBERANTE=0
    */
    SRSS_PWR_HIBERNATE &= HIBERNATE_RETAIN_STATUS_MASK;

    /* Read register to make sure it is settled */
    (void) SRSS_PWR_HIBERNATE;

    Cy_SysLib_ExitCriticalSection(interruptState);
}

bool Cy_SysPm_IoIsFrozen(void)
{
    return (0U != _FLD2VAL(SRSS_PWR_HIBERNATE_FREEZE, SRSS_PWR_HIBERNATE));
}

void Cy_SysPm_CpuSendWakeupEvent(void)
{
    __SEV();
}

bool Cy_SysPm_IsLpmReady(void)
{
    return (_FLD2BOOL(SRSS_PWR_CTL_LPM_READY, SRSS_PWR_CTL)? true : false);
}

void Cy_SysPm_BackupSetSupply(cy_en_syspm_vddbackup_control_t vddBackControl)
{
    CY_UNUSED_PARAMETER(vddBackControl);

#if (SRSS_BACKUP_VBCK_PRESENT)
    CY_ASSERT_L3(CY_SYSPM_IS_VDDBACKUP_VALID(vddBackControl));

    BACKUP_CTL = _CLR_SET_FLD32U((BACKUP_CTL), BACKUP_CTL_VDDBAK_CTL, (uint32_t) vddBackControl);
#endif
}


cy_en_syspm_vddbackup_control_t Cy_SysPm_BackupGetSupply(void)
{
#if (SRSS_BACKUP_VBCK_PRESENT)
    uint32_t retVal;
    retVal = _FLD2VAL(BACKUP_CTL_VDDBAK_CTL, BACKUP_CTL);

    return ((cy_en_syspm_vddbackup_control_t) retVal);
#else
    return (CY_SYSPM_VDDBACKUP_DEFAULT);
#endif
}


void Cy_SysPm_BackupEnableVoltageMeasurement(void)
{
#if (SRSS_BACKUP_VBCK_PRESENT)
    BACKUP_CTL |= BACKUP_CTL_VBACKUP_MEAS_Msk;
#endif
}


void Cy_SysPm_BackupDisableVoltageMeasurement(void)
{
#if (SRSS_BACKUP_VBCK_PRESENT)
    BACKUP_CTL &= ((uint32_t) ~BACKUP_CTL_VBACKUP_MEAS_Msk);
#endif
}


void Cy_SysPm_BackupSuperCapCharge(cy_en_syspm_sc_charge_key_t key)
{
    CY_UNUSED_PARAMETER(key);

#if (SRSS_BACKUP_VBCK_PRESENT)
    CY_ASSERT_L3(CY_SYSPM_IS_SC_CHARGE_KEY_VALID(key));

    if(key == CY_SYSPM_SC_CHARGE_ENABLE)
    {
        BACKUP_CTL = _CLR_SET_FLD32U((BACKUP_CTL), BACKUP_CTL_EN_CHARGE_KEY, (uint32_t) CY_SYSPM_SC_CHARGE_ENABLE);
    }
    else
    {
        BACKUP_CTL &= ((uint32_t) ~BACKUP_CTL_EN_CHARGE_KEY_Msk);
    }
#endif
}

void Cy_SysPm_BackupWordStore(uint32_t wordIndex, uint32_t *wordSrcPointer, uint32_t wordSize)
{
    CY_ASSERT_L3(CY_SYSPM_IS_WORD_INDEX_VALID(wordIndex));
    CY_ASSERT_L3(CY_SYSPM_IS_WORD_SIZE_VALID(wordSize + wordIndex));

    while(wordSize != 0UL)
    {
        BACKUP_BREG[wordIndex] = *wordSrcPointer;

        wordIndex++;
        wordSrcPointer++;
        wordSize--;
    }
}

void Cy_SysPm_BackupWordReStore(uint32_t wordIndex, uint32_t *wordDstPointer, uint32_t wordSize)
{
    CY_ASSERT_L3(CY_SYSPM_IS_WORD_INDEX_VALID(wordIndex));
    CY_ASSERT_L3(CY_SYSPM_IS_WORD_SIZE_VALID(wordSize + wordIndex));

    while(wordSize != 0UL)
    {
        *wordDstPointer = BACKUP_BREG[wordIndex];

        wordIndex++;
        wordDstPointer++;
        wordSize--;
    }
}

cy_en_syspm_status_t Cy_SysPm_SetSRAMMacroPwrMode(cy_en_syspm_sram_index_t sramNum, uint32_t sramMacroNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    cy_en_syspm_status_t status = CY_SYSPM_BAD_PARAM;

    CY_ASSERT_L1( sramNum < CPUSS_SRAM_COUNT );

    if(sramNum == CY_SYSPM_SRAM0_MEMORY)
    {
        CY_ASSERT_L1( sramMacroNum < CPUSS_RAMC0_MACRO_NR );
        if (sramMacroNum < CPUSS_RAMC0_MACRO_NR)
        {
            CPUSS_RAM0_PWR_MACRO_CTL(sramMacroNum) = _VAL2FLD(CPUSS_RAM0_PWR_MACRO_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                                _VAL2FLD(CPUSS_RAM0_PWR_MACRO_CTL_PWR_MODE, sramPwrMode);
            status = CY_SYSPM_SUCCESS;
        }
    }
    else if(sramNum == CY_SYSPM_SRAM1_MEMORY)
    {
        CY_ASSERT_L1( CPUSS_RAMC1_PRESENT );
        CY_ASSERT_L1( sramMacroNum == 0UL );

        CPUSS_RAM1_PWR_CTL = _VAL2FLD(CPUSS_RAM1_PWR_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                    _VAL2FLD(CPUSS_RAM1_PWR_CTL_PWR_MODE, sramPwrMode);
        status = CY_SYSPM_SUCCESS;
    }
    else if(sramNum == CY_SYSPM_SRAM2_MEMORY)
    {
        CY_ASSERT_L1( CPUSS_RAMC2_PRESENT );
        CY_ASSERT_L1( sramMacroNum == 0UL );

        CPUSS_RAM2_PWR_CTL = _VAL2FLD(CPUSS_RAM2_PWR_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                    _VAL2FLD(CPUSS_RAM2_PWR_CTL_PWR_MODE, sramPwrMode);
        status = CY_SYSPM_SUCCESS;
    }
    else
    {
        /* Invalid SRAM Number */
    }

