RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/drivers/source/cy_syspm_v3.c
    return status;
}


cy_en_syspm_sram_pwr_mode_t Cy_SysPm_GetSRAMMacroPwrMode(cy_en_syspm_sram_index_t sramNum, uint32_t sramMacroNum)
{
    uint32_t retVal = (uint32_t)CY_SYSPM_SRAM_PWR_MODE_INVALID;

    CY_ASSERT_L1( sramNum < CPUSS_SRAM_COUNT );

    if(sramNum == CY_SYSPM_SRAM0_MEMORY)
    {
        CY_ASSERT_L1( sramMacroNum < CPUSS_RAMC0_MACRO_NR );
        if (sramMacroNum < CPUSS_RAMC0_MACRO_NR)
        {
            retVal = _FLD2VAL(CPUSS_RAM0_PWR_MACRO_CTL_PWR_MODE, CPUSS_RAM0_PWR_MACRO_CTL(sramMacroNum));
        }
    }
    else if(sramNum == CY_SYSPM_SRAM1_MEMORY)
    {
        CY_ASSERT_L1( sramMacroNum == 0UL );
        retVal = _FLD2VAL(CPUSS_RAM1_PWR_CTL_PWR_MODE, CPUSS_RAM1_PWR_CTL);
    }
    else if(sramNum == CY_SYSPM_SRAM2_MEMORY)
    {
        CY_ASSERT_L1( sramMacroNum == 0UL );
        retVal = _FLD2VAL(CPUSS_RAM2_PWR_CTL_PWR_MODE, CPUSS_RAM2_PWR_CTL);
    }
    else
    {
        /* Invalid SRAM Number */
    }
    return (cy_en_syspm_sram_pwr_mode_t)retVal;
}


cy_en_syspm_status_t Cy_SysPm_SetSRAMPwrMode(cy_en_syspm_sram_index_t sramNum, cy_en_syspm_sram_pwr_mode_t sramPwrMode)
{
    uint32 idx;

    cy_en_syspm_status_t status = CY_SYSPM_BAD_PARAM;
    CY_ASSERT_L1( sramNum < CPUSS_SRAM_COUNT );

    if(sramNum == CY_SYSPM_SRAM0_MEMORY)
    {
        for(idx = 0UL; idx < CPUSS_RAMC0_MACRO_NR; idx++)
        {
            CPUSS_RAM0_PWR_MACRO_CTL(idx) = _VAL2FLD(CPUSS_RAM0_PWR_MACRO_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                        _VAL2FLD(CPUSS_RAM0_PWR_MACRO_CTL_PWR_MODE, sramPwrMode);
        }
        status = CY_SYSPM_SUCCESS;
    }
    else if(sramNum == CY_SYSPM_SRAM1_MEMORY)
    {
        CY_ASSERT_L1( CPUSS_RAMC1_PRESENT );
        CPUSS_RAM1_PWR_CTL = _VAL2FLD(CPUSS_RAM1_PWR_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                        _VAL2FLD(CPUSS_RAM1_PWR_CTL_PWR_MODE, sramPwrMode);
        status = CY_SYSPM_SUCCESS;

    }
    else if(sramNum == CY_SYSPM_SRAM2_MEMORY)
    {
        CY_ASSERT_L1( CPUSS_RAMC2_PRESENT );
        CPUSS_RAM2_PWR_CTL = _VAL2FLD(CPUSS_RAM2_PWR_CTL_VECTKEYSTAT, CY_SYSPM_PWR_MACRO_CTL_WRITE_KEY) |
                                        _VAL2FLD(CPUSS_RAM2_PWR_CTL_PWR_MODE, sramPwrMode);
        status = CY_SYSPM_SUCCESS;

    }
    else
    {
        /* Invalid SRAM Number */
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_SysPm_ReadStatus
****************************************************************************//**
*
* Reads the status of the core(s).
*
* \return The current power mode. See \ref group_syspm_return_status.
*
*******************************************************************************/
uint32_t Cy_SysPm_ReadStatus(void)
{
    uint32_t interruptState;
    uint32_t pmStatus = 0u;
    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Check whether CM7_0 is in the deep sleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM7_0_STATUS_SLEEPING, CPUSS_CM7_0_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM7_0_STATUS_SLEEPDEEP, CPUSS_CM7_0_STATUS)))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_0_DEEPSLEEP;
    }
    /* Check whether CM7_0 is in the sleep mode*/
    else if(0u != _FLD2VAL(CPUSS_CM7_0_STATUS_SLEEPING, CPUSS_CM7_0_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_0_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_0_ACTIVE;
    }

    /* Check whether CM7_1 is in the deep sleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM7_1_STATUS_SLEEPING, CPUSS_CM7_1_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM7_1_STATUS_SLEEPDEEP, CPUSS_CM7_1_STATUS)))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_1_DEEPSLEEP;
    }
    /* Check whether CM7_1 is in the sleep mode*/
    else if(0u != _FLD2VAL(CPUSS_CM7_1_STATUS_SLEEPING, CPUSS_CM7_1_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_1_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM7_1_ACTIVE;
    }


    /* Check whether CM0p is in the deep sleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM0_STATUS_SLEEPING, CPUSS_CM0_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM0_STATUS_SLEEPDEEP, CPUSS_CM0_STATUS)))
    {
        pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM0_DEEPSLEEP;
    }
    /* Check whether CM0p is in the sleep mode*/
    else if (0u != _FLD2VAL(CPUSS_CM0_STATUS_SLEEPING, CPUSS_CM0_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM0_SLEEP;
    }
    else
    {
        pmStatus |= CY_SYSPM_STATUS_CM0_ACTIVE;
    }

    /* Check whether the device is in LPACTIVE mode or not */
    if(Cy_SysPm_IsSystemLpActiveEnabled())
    {
        pmStatus |= CY_SYSPM_STATUS_SYSTEM_LOWPOWER;
    }

    Cy_SysLib_ExitCriticalSection(interruptState);

    return(pmStatus);
}

bool Cy_SysPm_Cm7IsActive(uint8_t core)
{
    bool status = false;

    if(core == CORE_CM7_0)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_0_ACTIVE) != 0u);
    }
    else if(core == CORE_CM7_1)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_1_ACTIVE) != 0u);
    }
    else
    {
        /* CM7 Not active */
    }

    return status;
}

bool Cy_SysPm_Cm7IsSleep(uint8_t core)
{
    bool status = false;

    if(core == CORE_CM7_0)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_0_SLEEP) != 0u);
    }
    else if(core == CORE_CM7_1)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_1_SLEEP) != 0u);
    }
    else
    {
        /* CM7 Not active */
    }

    return status;
}

bool Cy_SysPm_Cm7IsDeepSleep(uint8_t core)
{
    bool status = false;

    if(core == CORE_CM7_0)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_0_DEEPSLEEP) != 0u);
    }
    else if(core == CORE_CM7_1)
    {
        status = ((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_1_DEEPSLEEP) != 0u);
    }
    else
    {
        /* CM7 Not active */
    }

    return status;
}

bool Cy_SysPm_Cm7IsLowPower(uint8_t core)
{
    bool status = false;

    if(core == CORE_CM7_0)
    {
        return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_0_LOWPOWER) != 0u);
    }
    else if(core == CORE_CM7_1)
    {
        return((Cy_SysPm_ReadStatus() & CY_SYSPM_STATUS_CM7_1_LOWPOWER) != 0u);
    }
    else
    {
        /* CM7 Not active */
    }

